{
    "How do I place an order?": "Browse the products, add items to your cart, then proceed to checkout to complete your order.",
    "Can I order without creating an account?": "No, creating an account helps us process orders and provide updates efficiently.",
    "Can I modify my order after placing it?": "Orders can only be modified within 30 minutes of placement if not yet shipped.",
    "How long does delivery take?": "Standard shipping usually takes 2–5 business days depending on your location.",
    "How can I track my order?": "After shipping, you’ll receive a tracking number via email and in your account dashboard.",
    "Do you offer international shipping?": "Yes, we ship to over 50 countries. International shipping fees and customs apply.",
    "What should I do if my package hasn’t arrived?": "Please check your tracking number and contact support if the delay exceeds 7 days.",
    "What is your return policy?": "We accept returns within 14 days of delivery if items are unused and in original packaging.",
    "How do I request a return?": "Log in to your account, go to order history, and click on 'Request Return' next to the item.",
    "Do I have to pay for return shipping?": "Return shipping is free for defective or incorrect items. Otherwise, you cover the cost.",
    "Can I exchange an item?": "We do not offer direct exchanges. Please return the item and place a new order.",
    "When will I receive my refund?": "Refunds are processed within 5–7 business days after receiving your return.",
    "What payment methods do you accept?": "We accept Visa, MasterCard, PayPal, Apple Pay, and Google Pay.",
    "Is my payment information secure?": "Yes, all transactions are encrypted and processed through secure payment gateways.",
    "Can I use more than one promo code?": "Only one promo code can be applied per order unless stated otherwise.",
    "Do you offer student discounts?": "Yes, students can get 10% off after verifying their student status through our partner portal.",
    "Can I cancel my order?": "You can cancel an order within 1 hour of placing it unless it has already been shipped.",
    "Why was my order canceled?": "Orders may be canceled due to payment issues or item unavailability. You’ll be notified by email.",
    "Do you have a mobile app?": "Yes, our app is available on both iOS and Android for a better shopping experience.",
    "How can I contact customer support?": "You can contact us via the Help Center, email, or live chat between 9 AM – 6 PM weekdays.",
    "What if I received the wrong item?": "We’re sorry! Contact customer service and we’ll send the correct item at no extra charge.",
    "Can I change my shipping address?": "Yes, but only if the order has not yet been shipped. Contact support as soon as possible.",
    "Do you sell gift cards?": "Yes, we offer digital gift cards in various denominations, delivered instantly by email.",
    "Can I use a gift card and a credit card together?": "Yes, you can use a gift card and pay the remaining balance with a credit card.",
    "Are there any subscription plans?": "Yes, we offer a monthly membership for discounts, early access, and free returns.",
    "How do I unsubscribe from emails?": "Click the unsubscribe link at the bottom of any email or adjust your preferences in your account.",
    "Can I reorder a previous purchase?": "Yes, log in and view your order history to reorder with a single click.",
    "Do you have physical stores?": "Currently, we are online-only but occasionally host pop-up shops in select cities.",
    "How do I apply for a job?": "Visit our careers page to view current openings and submit your application.",
    "How do I leave a review?": "After your purchase, you’ll receive a review link by email or you can review via your account."
}